Revit 2024 API
BuiltInFailures.StairRampFailures.WinderLegsAngleTooGreatOrRunWidthTooSmallFailure Property
 The angle between two consecutive legs are too great or the runwidth is too small.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId WinderLegsAngleTooGreatOrRunWidthTooSmallFailure { get; }
Visual Basic
Public Shared ReadOnly Property WinderLegsAngleTooGreatOrRunWidthTooSmallFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ WinderLegsAngleTooGreatOrRunWidthTooSmallFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace